# Wczytywanie pliku modelu
    read_verilog -sv Dodawanie.sv

# Utworzenie kopii modelu z inną nazwą
    copy Dodawanie Dodawanie_rtl

# Ustawienie hierarchii projektu na nowy moduł
    hierarchy -top Dodawanie_rtl

# synteza logiczna 
    synth
     
# Mapowaie na bramki
    abc -g AND,OR,XOR

# Optymalizacja po mapowaniu
    opt_clean

#zapis wyniku symulacji 
    write_verilog -noattr Dodawanie_rtl.sv

# Wypisywanie statystyki użytych bramek
    stat -tech cmos