# Wczytywanie pliku modelu
    read_verilog -sv Porownywanie.sv

# Utworzenie kopii modelu z inną nazwą
    copy Porownywanie Porownywanie_rtl

# Ustawienie hierarchii projektu na nowy moduł
    hierarchy -top Porownywanie_rtl

# synteza logiczna 
    synth
     
# Mapowaie na bramki
    abc -g AND,OR,XOR

# Optymalizacja po mapowaniu
    opt_clean

#zapis wyniku symulacji 
    write_verilog -noattr Porownywanie_rtl.sv

# Wypisywanie statystyki użytych bramek
    stat -tech cmos