# Wczytywanie pliku modelu
    read_verilog -sv ustawianie.sv

# Utworzenie kopii modelu z inną nazwą
    copy ustawianie ustawianie_rtl

# Ustawienie hierarchii projektu na nowy moduł
    hierarchy -top ustawianie_rtl

# synteza logiczna 
    synth
     
# Mapowaie na bramki
    abc -g AND,OR,XOR

# Optymalizacja po mapowaniu
    opt_clean

#zapis wyniku symulacji 
    write_verilog -noattr ustawianie_rtl.sv

# Wypisywanie statystyki użytych bramek
    stat -tech cmos